文档/测试工作相关/End-to-end integration test/测试内容相关/2020/20200701/“无线播播宝盒”业务-新增iptv机顶盒类型配置  (206500803)/报文查询结果/后付费有线宽带拆机带省高清业务(ITV)子产品属性为无线播播宝盒/WMX2020070205552100_后付费有线宽带拆机带省高清业务(ITV)子产品_无线播播宝盒_PAL查询综资创服务结果.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:san="http://sanss.com" xmlns:java="java:com.sanss.ibp.nonphs.ra.system97" xmlns:java1="java:com.sanss.ibp.nonphs.ra.common">
	<soapenv:Header/>
	<soapenv:Body>
		<san:createIntResService>
			<san:createIntResServiceRequest>
				<java:WpRequestBasicInfo>
					<java:CrmProductId>524</java:CrmProductId>
					<java:CrmQuoteNumber>WMX2020070205552100</java:CrmQuoteNumber>
					<java:CrmVersion>1</java:CrmVersion>
					<java:DoType>do</java:DoType>
					<java:EventIdP6>1593660178392</java:EventIdP6>
					<java:P6OrderId>65674</java:P6OrderId>
					<java:P6Version>1.0.0.0.0</java:P6Version>
					<java:SubActionCode>C01</java:SubActionCode>
					<java:ProcessDesc>C01</java:ProcessDesc>
					<java:ProcessType>C</java:ProcessType>
					<java:UserId>KD2003070464</java:UserId>
					<java:WpType>adsl</java:WpType>
				</java:WpRequestBasicInfo>
				<java:OldProduct>
					<java:Name>adsl</java:Name>
					<java:Aid>400152457700</java:Aid>
					<java:Properties>
						<java1:Name>pots_adsl_process_flag</java1:Name>
						<java1:Value>ADSL-C</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>sxflag</java1:Name>
						<java1:Value>N</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>handlerlogin</java1:Name>
						<java1:Value>HEBING</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>service_account</java1:Name>
						<java1:Value>住宅188</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>account_price_type</java1:Name>
						<java1:Value>住宅</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>account_price_sub_type</java1:Name>
						<java1:Value>普通住宅</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>account_number</java1:Name>
						<java1:Value>400000180073</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>account_primary_identity_number</java1:Name>
						<java1:Value>98271233444</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>account_primary_identity_type</java1:Name>
						<java1:Value>护照</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>address_full</java1:Name>
						<java1:Value>武川路99弄101号4层405室</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>address_id</java1:Name>
						<java1:Value>143627089</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>contact_person</java1:Name>
						<java1:Value>住宅188</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>contact_tel</java1:Name>
						<java1:Value>16626160091</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>note</java1:Name>
						<java1:Value>||</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>sub_bureau_code</java1:Name>
						<java1:Value>162</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>bureau_code</java1:Name>
						<java1:Value>2</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>crm_product_code</java1:Name>
						<java1:Value>524</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>district</java1:Name>
						<java1:Value>1</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>download_speed</java1:Name>
						<java1:Value>F</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>upload_speed</java1:Name>
						<java1:Value>D</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>billing_type</java1:Name>
						<java1:Value>1</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>monthly_hour</java1:Name>
						<java1:Value>1</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>cooperation_type</java1:Name>
						<java1:Value>A</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>connect_type</java1:Name>
						<java1:Value>1</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>account_no</java1:Name>
						<java1:Value>82511638</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>crm_product_name</java1:Name>
						<java1:Value>后付费宽带拨号</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>broadband_access_type</java1:Name>
						<java1:Value>5</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>onu_active_result</java1:Name>
						<java1:Value>Y</java1:Value>
					</java:Properties>
					<java:Products>
						<java:Properties>
							<java1:Name>dimension3_id</java1:Name>
							<java1:Value>100</java1:Value>
						</java:Properties>
						<java:Properties>
							<java1:Name>dimension2_epg</java1:Name>
							<java1:Value>100</java1:Value>
						</java:Properties>
						<java:Properties>
							<java1:Name>dimension1_package</java1:Name>
							<java1:Value>100</java1:Value>
						</java:Properties>
						<java:Properties>
							<java1:Name>iptv_type</java1:Name>
							<java1:Value>2</java1:Value>
						</java:Properties>
						<java:Properties>
							<java1:Name>set_top_box_4k</java1:Name>
							<java1:Value>18</java1:Value>
						</java:Properties>
						<java:Name>iptv_4k</java:Name>
						<java:Aid>400152457702</java:Aid>
					</java:Products>
				</java:OldProduct>
			</san:createIntResServiceRequest>
		</san:createIntResService>
	</soapenv:Body>
</soapenv:Envelope>